<details><summary>Show Plan</summary>

```

terraform
data.assert_test.workspace: Reading...
data.assert_test.workspace: Read complete after 0s
module.o11y.grafana_data_source.cloudwatch: Refreshing state... [id=60]
module.o11y.grafana_dashboard.at_a_glance: Refreshing state... [id=staging_keyserver]
data.aws_ecr_repository.repository: Reading...
aws_prometheus_workspace.prometheus: Refreshing state... [id=ws-e93280fb-403a-4a6d-ae0b-c24153d81eac]
module.dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/4a2b7414-8a24-4235-aa0f-b5db9efab83c]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...
module.dns.data.aws_route53_zone.hosted_zone: Reading...
module.ecs.data.aws_ecr_image.service_image: Reading...
data.aws_vpc.vpc: Reading...
module.ecs.aws_cloudwatch_log_group.cluster_logs: Refreshing state... [id=staging_keyserver_logs]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=staging_keyserver_ecs_task_execution_role]
module.o11y.grafana_data_source.prometheus: Refreshing state... [id=61]
module.ecs.data.aws_ecr_image.service_image: Read complete after 0s [id=sha256:435f454abd0fd73a856b271ddfd1e35b0aceceeeddcd4ce42a2faf568b50557b]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=staging_keyserver_ecs_task_execution_role-20221122174714851800000004]
module.ecs.aws_iam_role_policy_attachment.prometheus_write_policy: Refreshing state... [id=staging_keyserver_ecs_task_execution_role-20221122174714840300000002]
module.ecs.aws_iam_role_policy_attachment.cloudwatch_write_policy: Refreshing state... [id=staging_keyserver_ecs_task_execution_role-20221122174714846400000003]
module.dns.data.aws_route53_zone.hosted_zone: Read complete after 1s [id=Z098781520DYMYC4P6VDC]
module.dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z098781520DYMYC4P6VDC__d10fe09d59a830b084d8db90d6842763.staging.keys.walletconnect.com._CNAME]
module.ecs.aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:cluster/staging_keyserver_cluster]
data.aws_ecr_repository.repository: Read complete after 1s [id=keyserver]
data.aws_vpc.vpc: Read complete after 2s [id=vpc-09dce0b23af575478]
module.ecs.aws_security_group.tls_ingess: Refreshing state... [id=sg-047249176e9c36cf6]
module.ecs.aws_security_group.vpc_app_ingress: Refreshing state... [id=sg-06ca36f105b5735c9]
data.aws_subnets.private_subnets: Reading...
data.aws_subnets.public_subnets: Reading...
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-200/98f130148786d8e7]
data.aws_subnets.public_subnets: Read complete after 0s [id=eu-central-1]
data.aws_subnets.private_subnets: Read complete after 0s [id=eu-central-1]
module.ecs.aws_alb.network_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/net/staging-keyserver-lb-015/e233eea7a1247c34]
module.ecs.aws_ecs_task_definition.app_task: Refreshing state... [id=staging_keyserver]
module.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:service/staging_keyserver_cluster/staging_keyserver-service]
module.ecs.aws_route53_record.dns_load_balancer: Refreshing state... [id=Z098781520DYMYC4P6VDC_staging.keys.walletconnect.com_A]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/staging-keyserver-lb-015/e233eea7a1247c34/b26dc3ee0f115e4a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_keyserver_cluster/staging_keyserver-service"
        name                               = "staging_keyserver-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:1" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task must be replaced
-/+ resource "aws_ecs_task_definition" "app_task" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:1" -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 256
                  - dependsOn        = [
                      - {
                          - condition     = "START"
                          - containerName = "aws-otel-collector"
                        },
                    ]
                  - environment      = []
                  - essential        = true
                  - image            = "898587786287.dkr.ecr.eu-central-1.amazonaws.com/keyserver:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "staging_keyserver_logs"
                          - awslogs-region        = "eu-central-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "staging_keyserver"
                  - portMappings     = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = []
                },
              - {
                  - command          = [
                      - "--config=/etc/ecs/ecs-amp-prometheus.yaml",
                    ]
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "AWS_PROMETHEUS_ENDPOINT"
                          - value = "https://aps-workspaces.eu-central-1.amazonaws.com/workspaces/ws-e93280fb-403a-4a6d-ae0b-c24153d81eac/api/v1/remote_write"
                        },
                      - {
                          - name  = "AWS_PROMETHEUS_SCRAPING_ENDPOINT"
                          - value = "0.0.0.0:8080"
                        },
                    ]
                  - essential        = true
                  - image            = "public.ecr.aws/aws-observability/aws-otel-collector:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-create-group  = "True"
                          - awslogs-group         = "/ecs/staging_keyserver-ecs-aws-otel-sidecar-collector"
                          - awslogs-region        = "eu-central-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - mountPoints      = []
                  - name             = "aws-otel-collector"
                  - portMappings     = []
                  - volumesFrom      = []
                },
            ]
        ) -> (sensitive value) # forces replacement
      ~ id                       = "staging_keyserver" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

      ~ runtime_platform {
            # (1 unchanged attribute hidden)
        }
    }

  # module.keystore-docdb.data.aws_secretsmanager_secret.master_password will be read during apply
  # (config refers to values not yet known)
 <= data "aws_secretsmanager_secret" "master_password" {
      + arn                 = (known after apply)
      + description         = (known after apply)
      + id                  = (known after apply)
      + kms_key_id          = (known after apply)
      + name                = (known after apply)
      + policy              = (known after apply)
      + rotation_enabled    = (known after apply)
      + rotation_lambda_arn = (known after apply)
      + rotation_rules      = (known after apply)
      + tags                = (known after apply)
    }

  # module.keystore-docdb.data.aws_secretsmanager_secret_version.master_password will be read during apply
  # (config refers to values not yet known)
 <= data "aws_secretsmanager_secret_version" "master_password" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_binary  = (sensitive value)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.keystore-docdb.aws_docdb_cluster.docdb_primary will be created
  + resource "aws_docdb_cluster" "docdb_primary" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + availability_zones              = (known after apply)
      + backup_retention_period         = 1
      + cluster_identifier              = "staging-keyserver-keystore-docdb-primary-cluster"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + db_cluster_parameter_group_name = (known after apply)
      + db_subnet_group_name            = "staging-keyserver-keystore-docdb-private-subnet-group"
      + enabled_cloudwatch_logs_exports = [
          + "audit",
        ]
      + endpoint                        = (known after apply)
      + engine                          = "docdb"
      + engine_version                  = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = (known after apply)
      + master_password                 = (sensitive value)
      + master_username                 = "relay"
      + port                            = 27017
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = false
      + storage_encrypted               = true
      + tags_all                        = {
          + "Application"      = "keyserver"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + vpc_security_group_ids          = (known after apply)
    }

  # module.keystore-docdb.aws_docdb_cluster_instance.docdb_instances[0] will be created
  + resource "aws_docdb_cluster_instance" "docdb_instances" {
      + apply_immediately            = (known after apply)
      + arn                          = (known after apply)
      + auto_minor_version_upgrade   = true
      + availability_zone            = (known after apply)
      + ca_cert_identifier           = (known after apply)
      + cluster_identifier           = (known after apply)
      + db_subnet_group_name         = (known after apply)
      + dbi_resource_id              = (known after apply)
      + endpoint                     = (known after apply)
      + engine                       = "docdb"
      + engine_version               = (known after apply)
      + id                           = (known after apply)
      + identifier                   = "staging-keyserver-keystore-docdb-primary-instance-0"
      + identifier_prefix            = (known after apply)
      + instance_class               = "db.r5.large"
      + kms_key_id                   = (known after apply)
      + port                         = (known after apply)
      + preferred_backup_window      = (known after apply)
      + preferred_maintenance_window = (known after apply)
      + promotion_tier               = 0
      + publicly_accessible          = (known after apply)
      + storage_encrypted            = (known after apply)
      + tags_all                     = {
          + "Application"      = "keyserver"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + writer                       = (known after apply)
    }

  # module.keystore-docdb.aws_docdb_subnet_group.private_subnets will be created
  + resource "aws_docdb_subnet_group" "private_subnets" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "staging-keyserver-keystore-docdb-private-subnet-group"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-006f9fc131af3565e",
          + "subnet-05894f2d41c0e8b45",
          + "subnet-06557bf48886434f1",
        ]
      + tags_all    = {
          + "Application"      = "keyserver"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
    }

  # module.keystore-docdb.aws_kms_key.docdb_encryption will be created
  + resource "aws_kms_key" "docdb_encryption" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = (known after apply)
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "Application"      = "keyserver"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
    }

  # module.keystore-docdb.aws_secretsmanager_secret.master_password will be created
  + resource "aws_secretsmanager_secret" "master_password" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "staging-keyserver-keystore-docdb-master-password"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "Application"      = "keyserver"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # module.keystore-docdb.aws_secretsmanager_secret_version.master_password will be created
  + resource "aws_secretsmanager_secret_version" "master_password" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.keystore-docdb.aws_security_group.service_security_group will be created
  + resource "aws_security_group" "service_security_group" {
      + arn                    = (known after apply)
      + description            = "Allow ingress from the application"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.192.0.0/16",
                ]
              + description      = "Allow outbound traffic from the DocDB cluster"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.192.0.0/16",
                ]
              + description      = "Allow inbound traffic to the DocDB cluster"
              + from_port        = 27017
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 27017
            },
        ]
      + name                   = "staging-keyserver-keystore-docdb-service"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Application"      = "keyserver"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + vpc_id                 = "vpc-09dce0b23af575478"
    }

  # module.keystore-docdb.random_password.master_password will be created
  + resource "random_password" "master_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.o11y.grafana_data_source.cloudwatch will be updated in-place
  ~ resource "grafana_data_source" "cloudwatch" {
        id                 = "60"
      + json_data_encoded  = jsonencode(
            {
              + defaultRegion = "eu-central-1"
            }
        )
        name               = "staging-keyserver-cloudwatch"
        # (6 unchanged attributes hidden)

      - json_data {
          - conn_max_lifetime             = 0 -> null
          - default_region                = "eu-central-1" -> null
          - manage_alerts                 = false -> null
          - max_concurrent_shard_requests = 0 -> null
          - max_idle_conns                = 0 -> null
          - max_lines                     = 0 -> null
          - max_open_conns                = 0 -> null
          - postgres_version              = 0 -> null
          - sigv4_auth                    = false -> null
          - timescaledb                   = false -> null
          - tls_auth                      = false -> null
          - tls_auth_with_ca_cert         = false -> null
          - tls_skip_verify               = false -> null
          - tsdb_resolution               = 0 -> null
          - tsdb_version                  = 0 -> null
          - xpack_enabled                 = false -> null
        }
    }

  # module.o11y.grafana_data_source.prometheus will be updated in-place
  ~ resource "grafana_data_source" "prometheus" {
        id                 = "61"
      + json_data_encoded  = jsonencode(
            {
              + httpMethod    = "GET"
              + sigV4Auth     = true
              + sigV4AuthType = "workspace-iam-role"
              + sigV4Region   = "eu-central-1"
            }
        )
        name               = "staging-keyserver-amp"
        # (7 unchanged attributes hidden)

      - json_data {
          - conn_max_lifetime             = 0 -> null
          - http_method                   = "GET" -> null
          - manage_alerts                 = false -> null
          - max_concurrent_shard_requests = 0 -> null
          - max_idle_conns                = 0 -> null
          - max_lines                     = 0 -> null
          - max_open_conns                = 0 -> null
          - postgres_version              = 0 -> null
          - sigv4_auth                    = true -> null
          - sigv4_auth_type               = "workspace-iam-role" -> null
          - sigv4_region                  = "eu-central-1" -> null
          - timescaledb                   = false -> null
          - tls_auth                      = false -> null
          - tls_auth_with_ca_cert         = false -> null
          - tls_skip_verify               = false -> null
          - tsdb_resolution               = 0 -> null
          - tsdb_version                  = 0 -> null
          - xpack_enabled                 = false -> null
        }
    }

Plan: 9 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/plan.tfplan"

```

</details>

*Action: `pull_request`*